בתרגיל זה תעבדו עם  
employee.csv
לפני התחלת התרגיל יש להסיר את כל הכפילויות מעמודת שם המשפחה ולהפוך את העמודה הזו לאינדקס.
על מנת ליעל ביצועים - לאחר האינדוקס יש לסדר את הערכים מחדש על פי האינדקס שיצרתם

In [1]:
import pandas as pd

In [2]:
emps = pd.read_csv("employee.csv")

In [3]:
emps.head()

  first_name   last_name  salary  start_date    gender  remote         team
0    Haleigh  Calderhead  334473    5/9/2020       NaN    True   management
1    Coretta      McEvon  637457   3/20/2020      Male   False  engineering
2   Clarette     Tarbett  977749  11/22/2020   Agender    True  engineering
3      Jaime  Gianneschi  253523    9/2/2020  Bigender   False    marketing
4      Ediva     Skelton  325185    2/4/2020    Female    True    marketing

In [4]:
emps.duplicated("last_name").sum()

np.int64(6)

In [5]:
emps = emps.drop_duplicates("last_name")

In [6]:
emps.info()

<class 'pandas.core.frame.DataFrame'>
Index: 994 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  994 non-null    object
 1   last_name   994 non-null    object
 2   salary      994 non-null    int64
 3   start_date  970 non-null    object
 4   gender      960 non-null    object
 5   remote      994 non-null    bool
 6   team        994 non-null    object
dtypes: bool(1), int64(1), object(5)
memory usage: 55.3+ KB

In [7]:
emps = emps.set_index(keys="last_name")

In [8]:
emps.info()

<class 'pandas.core.frame.DataFrame'>
Index: 994 entries, Calderhead to Hunt
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  994 non-null    object
 1   salary      994 non-null    int64
 2   start_date  970 non-null    object
 3   gender      960 non-null    object
 4   remote      994 non-null    bool
 5   team        994 non-null    object
dtypes: bool(1), int64(1), object(4)
memory usage: 47.6+ KB

In [9]:
emps = emps.sort_index()

In [10]:
emps.head()

,first_name,salary,start_date,gender,remote,team
last_name,,,,,,
Abdon,Kattie,589227,9/28/2020,Male,True,engineering
Ablewhite,Aeriela,357296,5/19/2020,Agender,False,engineering
Abramino,Kaitlyn,133860,7/12/2020,Polygender,True,management
Abramowitch,Gwyneth,599067,9/24/2020,Genderqueer,True,engineering
Ackenhead,Timofei,916900,10/14/2020,Male,True,data analytics

---

**את השאלות הבאות יש לפתור בעזרת loc/iloc**  
1. מה הפרטים בשורה שהאינדקס שלה הוא 
Hilliam
2.  מה הפרטים של העובדים מ  
   Dunne  
עד Edden
3. עבור העובדים מסעיף 2 הציגו רק כל עובד שלישי ורק את העמודות משכורת וצוות

In [11]:
emps.loc["Hilliam"]

first_name        Lishe
salary           882890
start_date    5/11/2020
gender           Female
remote            False
team          marketing
Name: Hilliam, dtype: object

In [14]:
emps.loc["Dunne":"Edden"]

          first_name  salary  start_date       gender  remote            team
last_name
Dunne        Kikelia  389606  12/11/2020      Agender   False  data analytics
Dunnion       Valeda  358348   9/16/2020       Female   False     engineering
Durtnel       Lucien  482986  10/21/2020  Genderqueer   False  data analytics
Dyers          Grata  770722    7/3/2020      Agender    True     engineering
Eakins        Celine  199060   4/10/2020         Male    True     engineering
Earingey     Cherlyn  270537   5/22/2020      Agender    True      management
Eassom           Ase  530597   6/16/2020       Female    True     engineering
Eastgate        Lexi  194376   3/30/2020     Bigender   False     engineering
Eates        Hoebart  508366   12/6/2020  Genderfluid   False     engineering
Ebbett          Cris  590135  12/26/2020   Non-binary   False  data analytics
Eckery           Deb  506010   2/21/2020   Non-binary    True  data analytics
Edbrooke    Charisse  422117    7/9/2020      Agender   False     engineering
Edden            Wyn  565477   2/28/2020  Genderqueer   False      management

In [19]:
emps.loc["Dunne":"Edden":3, ["salary"]]

           salary
last_name
Dunne      389606
Dyers      770722
Eassom     530597
Ebbett     590135
Edden      565477